# =============================================================================
# Taps
# =============================================================================
{{ if .kubernetes -}}
tap "hashicorp/tap"
{{ end -}}
{{ if .macos_cosmetic -}}
tap "lihaoyun6/tap"
tap "theboredteam/boring-notch"
{{ end -}}

# =============================================================================
# Base — always installed
# =============================================================================

# Shell infrastructure
brew "atuin"
brew "carapace"
brew "direnv"
brew "fzf"
brew "mise"
brew "sheldon"
brew "starship"
brew "zoxide"

# Git
brew "git-delta"
brew "gnupg"
brew "lazygit"
brew "pinentry-mac"

# Core CLI
brew "btop"
brew "jq"
brew "yq"
brew "just"
brew "mac-cleanup-go"
brew "rust"
brew "shfmt"
brew "wget2"

# Terminal & Font
cask "kitty"
cask "font-meslo-lg-nerd-font"

# Editor
{{ if eq .editor "fresh" -}}
brew "fresh-editor"
{{ end -}}

brew "chezmoi"
brew "exiftool"
brew "imagemagick"
brew "jpegoptim"
brew "parallel"
brew "pv"
brew "zsh-syntax-highlighting"
# =============================================================================
# Alt-tools — modern CLI replacements
# =============================================================================
{{ if .alt_tools -}}
brew "bat"
brew "doggo"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "gping"
brew "gron"
brew "jid"
brew "navi"
brew "ripgrep"
brew "tldr"
brew "xh"
{{ end -}}

# =============================================================================
# Bitwarden
# =============================================================================
{{ if .bitwarden -}}
brew "bitwarden-cli"
cask "bitwarden"
{{ end -}}

# =============================================================================
# Docker + Colima
# =============================================================================
{{ if .docker -}}
brew "colima", restart_service: :changed
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "lima-additional-guestagents"
{{ end -}}

# =============================================================================
# Kubernetes
# =============================================================================
{{ if .kubernetes -}}
brew "helm"
brew "kubecolor"
brew "kubernetes-cli"
brew "kubectx"
brew "k9s"
brew "mintoolkit"
brew "stern"
brew "hashicorp/tap/vault"
cask "gcloud-cli"
brew "kustomize"
{{ end -}}

# =============================================================================
# Java (runtime managed via mise, libpq for psql client)
# =============================================================================
{{ if .java -}}
brew "libpq", link: true
{{ end -}}

# =============================================================================
# macOS utilities
# =============================================================================
{{ if .macos_utils -}}
cask "alt-tab"
cask "displaylink"
cask "hammerspoon"
cask "hot"
cask "linearmouse"
cask "mos@beta"
cask "raycast"
brew "sniffnet"
cask "8bitdo-ultimate-software"
cask "calibre"
cask "grammarly-desktop"
cask "keyboardcleantool"
cask "nordvpn"
cask "notion"
cask "obsidian"
cask "qmk-toolbox"
cask "transmission"
cask "utm"
{{ end -}}

# =============================================================================
# macOS cosmetic
# =============================================================================
{{ if .macos_cosmetic -}}
cask "lihaoyun6/tap/airbattery"
cask "theboredteam/boring-notch/boring-notch"
cask "cork"
{{ end -}}

# =============================================================================
# Media & communication
# =============================================================================
{{ if .macos_media -}}
cask "brave-browser"
cask "slack"
cask "spotify"
cask "telegram"
brew "spicetify-cli"
cask "discord"
cask "iina"
cask "steam"
{{ end -}}

# =============================================================================
# Dev apps
# =============================================================================
{{ if .dev_apps -}}
brew "gh"
brew "git-filter-repo"
brew "glab"
cask "claude"
cask "dbeaver-community"
cask "gimp"
cask "vscodium"

# VSCodium extensions
vscode "adpyke.codesnap"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "drinfinite.batch-rename"
vscode "gitlab.gitlab-workflow"
vscode "imgildev.ovsx-tree-maker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "pixl-garden.bongocat"
brew "cloudflared"
brew "git"
brew "hcloud"
brew "uv"
cask "cyberduck"
cask "macfuse"
{{ end -}}

# =============================================================================
# TouchBar
# =============================================================================
{{ if .touchbar -}}
cask "bettertouchtool"
{{ end -}}

# =============================================================================
# Gaming & peripherals
# =============================================================================
{{ if .gaming -}}
cask "8bitdo-ultimate-software"
cask "discord"
cask "qmk-toolbox"
cask "steam"
{{ end -}}
